app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
            <div class="rounded-circle p-2 bg-light border me-3" style="width: 40px; height: 40px; display: flex; align-items: center; justify-content: center;">
              <span class="text-secondary fw-bold small"><%= user.username.first.upcase %></span>