app/controllers/badges_controller.rb

  def index
    @badges = Badge.all
---
SELECT "badges".* FROM "badges"

  def set_badge
    @badge = Badge.find(params[:id])
---
SELECT "badges".* FROM "badges" WHERE "badges"."id" = 13 LIMIT 1