app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 14 LIMIT 1
---
  def set_categorie
    @category = Category.find(params[:id])