app/controllers/challenge_comments_controller.rb

SELECT "challenge_comments".* FROM "challenge_comments"
---
  def index
    @challenge_comments = ChallengeComment.all

SELECT "challenge_comments".* FROM "challenge_comments" WHERE "challenge_comments"."id" = 11 LIMIT 1
---
  def set_challenge_comment
    @challenge_comment = ChallengeComment.find(params[:id])