app/controllers/challenge_invites_controller.rb

SELECT "challenge_invites".* FROM "challenge_invites"
---
  def index
    @invites = ChallengeInvite.all