app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
  def index
    @challenges = Challenge.all

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 14 LIMIT 1
---
  def set_challenge
    @challenge = Challenge.find(params[:id])