app/controllers/challenge_participations_controller.rb

SELECT "challenge_participations".* FROM "challenge_participations"
---
  def index
    @participations = ChallengeParticipation.all

SELECT "challenge_participations".* FROM "challenge_participations" WHERE "challenge_participations"."id" = 16 LIMIT 1
---
  def show
    @participation = ChallengeParticipation.find(params[:id])