app/controllers/progress_logs_controller.rb

SELECT "progress_logs".* FROM "progress_logs"
---
  def index
    @logs = ProgressLog.all

SELECT "progress_logs".* FROM "progress_logs" WHERE "progress_logs"."id" = 1 LIMIT 1
---
  def set_progress_log
    @log = ProgressLog.find(params[:id])