app/controllers/user_badges_controller.rb

SELECT "user_badges".* FROM "user_badges"
---
  def index
    @user_badges = UserBadge.all

SELECT "user_badges".* FROM "user_badges" WHERE "user_badges"."id" = 2 LIMIT 1
---
  def set_user_badge
    @user_badge = UserBadge.find(params[:id])